{
    "name": "extreme death fire flame taco",
    "ingredients": [
        "4 tortillas",
        "1 pound ground beef",
        "1 tablespoon olive oil",
        "1/2 cup diced onions",
        "1/2 cup diced bell peppers",
        "2 cloves garlic, minced",
        "1 tablespoon chili powder",
        "1 teaspoon cayenne pepper",
        "1 teaspoon paprika",
        "1/2 teaspoon cumin",
        "1/2 teaspoon salt",
        "1/4 teaspoon black pepper",
        "1 cup shredded cheese",
        "1 cup shredded lettuce",
        "1/2 cup diced tomatoes",
        "1/4 cup chopped fresh cilantro",
        "Hot sauce (adjust according to spice preference)",
        "Sour cream (optional)",
        "Guacamole (optional)"
    ],
    "instructions": [
        "1. Heat the olive oil in a large skillet over medium heat.",
        "2. Add the onions, bell peppers, and garlic to the skillet. Sauté until they become softened and slightly browned.",
        "3. Add the ground beef to the skillet and break it up with a spoon. Cook until the beef is no longer pink.",
        "4. Add the chili powder, cayenne pepper, paprika, cumin, salt, and black pepper to the skillet. Stir well to coat the beef and vegetables with the spices. Cook for another 2-3 minutes.",
        "5. Warm the tortillas in a separate skillet or in the microwave.",
        "6. Assemble the tacos by placing a spoonful of the beef mixture onto each tortilla. Top with shredded cheese, lettuce, tomatoes, and cilantro.",
        "7. Drizzle hot sauce over the toppings, according to your spice preference.",
        "8. Optional: Serve with sour cream and guacamole on the side.",
        "9. Enjoy!"
    ],
    "description": "The Extreme Death Fire Flame Taco is a spicy and flavorful taco filled with seasoned ground beef, sautéed onions and bell peppers, and topped with a combination of cheese, lettuce, tomatoes, and cilantro. The hot sauce adds an extra kick, making it perfect for those who love fiery flavors.",
    "spice": 0,
    "Fav_counts": 0,
    "ratings": {}
}