{
    "name": "Reese's Pieces Pumpkin Cheesecake Bars",
    "ingredients": [
        "For the crust:",
        "1 1/2 cups graham cracker crumbs",
        "1/4 cup granulated sugar",
        "1/2 cup melted butter",
        "For the filling:",
        "16 oz cream cheese, softened",
        "1/2 cup granulated sugar",
        "1/2 cup pumpkin puree",
        "1 tsp vanilla extract",
        "2 eggs",
        "1 tsp pumpkin pie spice",
        "1/2 cup Reese's Pieces candies",
        "For the topping:",
        "1 cup heavy cream",
        "2 tbsp powdered sugar",
        "1/2 tsp vanilla extract",
        "1/4 cup chopped Reese's Pieces candies"
    ],
    "instructions": [
        "1. Preheat your oven to 325°F (165°C) and line a 9x9-inch baking dish with parchment paper, leaving an overhang on the sides for easy removal later.",
        "2. In a medium bowl, combine graham cracker crumbs, sugar, and melted butter. Stir until well combined.",
        "3. Press the crumb mixture evenly into the bottom of the prepared baking dish, forming the crust layer. Use the back of a spoon or the bottom of a glass to ensure it is compact.",
        "4. In a large mixing bowl, beat cream cheese and sugar together until smooth and creamy.",
        "5. Add pumpkin puree, vanilla extract, eggs, and pumpkin pie spice to the cream cheese mixture. Beat until well combined.",
        "6. Gently fold in the Reese's Pieces candies into the cream cheese mixture.",
        "7. Pour the filling over the crust in the baking dish, spreading it out evenly with a spatula.",
        "8. Bake for 40-45 minutes, or until the edges are set and the center is slightly jiggly.",
        "9. Remove from the oven and let the cheesecake bars cool completely in the baking dish on a wire rack.",
        "10. Once the bars are completely cooled, refrigerate for at least 3 hours or overnight to set.",
        "11. In a medium mixing bowl, whip the heavy cream, powdered sugar, and vanilla extract until stiff peaks form.",
        "12. Spread the whipped cream over the chilled cheesecake bars, creating a smooth and even layer.",
        "13. Sprinkle the chopped Reese's Pieces candies on top of the whipped cream, gently pressing them in.",
        "14. Lift the parchment paper by the overhangs to remove the cheesecake bars from the baki"
    ],
    "description": "",
    "spice": 0,
    "Fav_counts": 0,
    "ratings": {}
}